import sys

'''
      현주는 1번부터 N번까지 N개의 상자를 가지고 있다. 각 상자에는 숫자를 새길 수 있는데 처음에는 모두 0으로 적혀있다.

숫자가 너무 단조로웠던 현주는 다음 Q회 동안 일정 범위의 연속한 상자를 동일한 숫자로 변경하려고 한다. 변경하는 방법은 다음과 같다.

   ·  i (1 ≤ i ≤ Q)번째 작업에 대해 L번 상자부터 R번 상자까지의 값을 i로 변경

현주가 Q회 동안 위의 작업을 순서대로 한 다음 N개의 상자에 적혀있는 값들을 순서대로 출력하는 프로그램을 작성하라.



[입력]

첫 번째 줄에 테스트 케이스의 수 T가 주어진다.

각 테스트 케이스의 첫 번째 줄에는 두 정수 N, Q (1 ≤ N, Q ≤ 103)가 공백으로 구분되어 주어진다.

다음 Q개의 줄의 i번째 줄에는 Li, Ri (1 ≤ Li ≤ Ri ≤ N)이 주어진다.

[출력]

각 테스트 케이스마다 첫 번째 줄에는 ‘#x’(x는 테스트케이스 번호를 의미하며 1부터 시작한다)를 출력하고,

각 테스트 케이스마다 Q개의 작업을 수행한 다음 1번부터 N번까지의 상자에 적혀있는 값들을 순서대로 출력한다.

1
5 2
1 3
2 4
// Test Case 개수
// 첫 번째 Test Case, N=5, Q=2
// i = 1일 때, L=1, R=3
// i = 2일 때, L=2, R=4
'''
sys.stdin = open("input.txt", "r")

T = int(input('테스트 케이스 개수: '))  # 테스트 케이스 개수
for test_case in range(1, T + 1):  # 테스트 케이스 만큼 돌기
    N, Q = map(int, input('상자 개수, 변경 횟수: ').split())  # 상자 개수 N, 숫자 변경 횟수 Q
    boxes = [0 for _ in range(N)]  # 상자 N개를 0으로 초기화
    # [0, 0, 0, 0, 0]
    for i in range(1, Q + 1):  # Q번 만큼 숫자 변경, 그 중 몇 번 째 줄인지 i 사용(1 ~ Q)
        Li, Ri = map(int, input('변경 범위 시작점, 종점: ').split())  # 숫자 변경 범위 입력 Li는 시작점 Ri는 끝나는 지점
        for idx in range(Li - 1, Ri):  # 변경할 상자 위치 시작점 Li, 끝나는 지점 Ri
            boxes[idx] = i             # 변경하고자 하는 숫자를 해당 인덱스에 맞춰서 넣기
        # i=1 [1, 1, 1, 0, 0]
        # i=2 [1, 2, 2, 2, 0]

    print(f"#{test_case}", end=' ')  # 출력
    print(*boxes)

